app/controllers/courses_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "courses".* FROM "courses"
---
    def index
        if params[:id]
            @courses = User.find(:id).courses
            render json: @courses
        else
            @courses = Course.all