app/controllers/lessons_controller.rb

SELECT "lessons".* FROM "lessons" WHERE "lessons"."course_id" = $1  [["course_id", 39]]
SELECT  1 AS one FROM "lessons" WHERE "lessons"."course_id" = $1 LIMIT $2  [["course_id", 38], ["LIMIT", 1]]
SELECT "lessons".* FROM "lessons" WHERE "lessons"."course_id" = $1  [["course_id", 38]]
---
    def index
        @lessons = Lesson.where(course_id: params[:course_id])
        if @lessons.empty?

SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @lesson = Lesson.find_by(id: params[:id])