app/controllers/profiles_controller.rb

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 LIMIT $2  [["user_id", 114], ["LIMIT", 1]]
---
    def show
        @profile = Profile.find_by(user_id: params[:id])

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 LIMIT $2  [["user_id", 114], ["LIMIT", 1]]
UPDATE "profiles" SET "linkedin_url" = $1, "updated_at" = $2 WHERE "profiles"."id" = $3  [["linkedin_url", "https://www.linkedin.com/in/heytong/"], ["updated_at", "2020-01-04 23:26:51.598274"], ["id", 82]]
---
    def update
        profile = Profile.find_by(user_id: params[:id])
        if profile.update(profile_params)