app/controllers/user_courses_controller.rb

INSERT INTO "user_courses" ("user_id", "course_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 114], ["course_id", 39], ["created_at", "2020-01-05 16:42:00.102449"], ["updated_at", "2020-01-05 16:42:00.102449"]]
---
    def create
        @user_course = UserCourse.new(user_course_params)
        if @user_course.save

SELECT  "user_courses".* FROM "user_courses" WHERE "user_courses"."id" = $1 LIMIT $2  [["id", 93], ["LIMIT", 1]]
---
    def show
        @user_course = UserCourse.find_by(id: params[:id])

SELECT  "user_courses".* FROM "user_courses" WHERE "user_courses"."id" = $1 LIMIT $2  [["id", 93], ["LIMIT", 1]]
UPDATE "user_courses" SET "completed" = $1, "updated_at" = $2 WHERE "user_courses"."id" = $3  [["completed", true], ["updated_at", "2020-01-05 17:20:37.640440"], ["id", 105]]
---
    def complete # course if complete if all lessons are complete
        @user_course = UserCourse.find(params[:id])
        if @user_course.completed == true
            render json: :course_already_completed
        else
            @user_course.completed = true
            @user_course.save