app/controllers/users_controller.rb

INSERT INTO "users" ("email", "first_name", "last_name", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        @user = User.new(user_params)
        if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 114], ["LIMIT", 1]]
UPDATE "users" SET "first_name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["first_name", "cindy"], ["updated_at", "2020-01-04 23:15:14.492589"], ["id", 114]]
---
    def update
        user = User.find_by(id: params[:id])
        if user.update(user_params)