app/controllers/user_lessons_controller.rb

INSERT INTO "user_lessons" ("user_id", "lesson_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 132], ["lesson_id", 121], ["created_at", "2020-01-05 17:23:04.105231"], ["updated_at", "2020-01-05 17:23:04.105231"]]
---
    def create
        @user_lesson = UserLesson.new(user_lesson_params)
        if @user_lesson.save

SELECT  "user_lessons".* FROM "user_lessons" WHERE "user_lessons"."id" = $1 LIMIT $2  [["id", 36], ["LIMIT", 1]]
---
    def show
        @user_lesson = UserLesson.find_by(id: params[:id])

SELECT  "user_lessons".* FROM "user_lessons" WHERE "user_lessons"."id" = $1 LIMIT $2  [["id", 43], ["LIMIT", 1]]
UPDATE "user_lessons" SET "completed" = $1, "updated_at" = $2 WHERE "user_lessons"."id" = $3  [["completed", true], ["updated_at", "2020-01-05 17:23:21.116354"], ["id", 43]]
---
    def complete
        @user_lesson = UserLesson.find(params[:id])
        if @user_lesson.completed == true
            render json: :lesson_already_completed
        else
            @user_lesson.completed = true
            @user_lesson.save