app/models/user_lesson.rb

    def complete_lesson
        self.update(completed: true)
        if self.lesson.final_lesson == true
            course = self.lesson.course
            user_course = UserCourse.find_by(course_id: course.id)
---
UPDATE "user_lessons" SET "completed" = $1, "updated_at" = $2 WHERE "user_lessons"."id" = $3  [["completed", true], ["updated_at", "2020-01-05 18:33:23.219186"], ["id", 51]]
SELECT  "user_courses".* FROM "user_courses" WHERE "user_courses"."course_id" = $1 LIMIT $2  [["course_id", 48], ["LIMIT", 1]]