app/models/user_course.rb

UPDATE "user_courses" SET "completed" = $1, "updated_at" = $2 WHERE "user_courses"."id" = $3  [["completed", true], ["updated_at", "2020-01-05 23:44:53.092441"], ["id", 116]]
---
    def complete_course
        self.update(completed: true)