app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "cindy@debuggingthis.com"], ["LIMIT", 1]]
---
    def self.find_by_credentials(email, password)
        user = self.find_by(email: email)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "FVZx_EW_W-vMgeJfLyyP4A"], ["updated_at", "2020-01-06 02:53:53.078233"], ["id", 142]]
---
    def reset_session_token!
        self.session_token = self.generate_session_token
        self.save

INSERT INTO "profiles" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 96], ["created_at", "2020-01-04 19:30:49.692218"], ["updated_at", "2020-01-04 19:30:49.692218"]]
---
    def create_profile
        Profile.create(user_id: self.id)